params <-
list(id = "007")

## ----setup, include=FALSE------------------------
knitr::opts_chunk$set(echo = TRUE)


## ------------------------------------------------
"\u0928\u092e\u0938\u094d\u0924\u0947 \u0926\u0941\u0928\u093f\u092f\u093e"


## ------------------------------------------------
num <- c(1.5, 2, 3)
int <- c(1L, 3L, -2L)
char <- c("1.5","2","3")
logi <- c(T,T,F)

typeof(num)
typeof(int)
typeof(char)
typeof(logi)


## ------------------------------------------------
class(num)
class(int)
class(char)
class(logi)


## ------------------------------------------------
"1"+"1.5"
1+1.5


## ------------------------------------------------
class("1")
class("1.5")


## ------------------------------------------------
as.numeric("1")


## ------------------------------------------------
a <- "1"
as.numeric(a) -> a
a+4


## ----haha----------------------------------------
# 10位學生的主系
majors10_char <- c('經濟學系','社會學系','社會學系','經濟學系','經濟學系','社會學系','經濟學系','經濟學系','經濟學系','社會學系')

typeof(majors10_char)
class(majors10_char)


## ------------------------------------------------
# 10位學生的主系
majors10_factor <- 
  factor(
  c('經濟學系','社會學系','社會學系','經濟學系','經濟學系','社會學系','經濟學系','經濟學系','經濟學系','社會學系')
  )
# OR
majors10_factor <- 
  factor(
    majors10_char
  )

typeof(majors10_factor)
class(majors10_factor)


## ------------------------------------------------


